## Python's `datetime` Module

In [2]:
import pandas as pd
import datetime as dt

In [49]:
dt.datetime.now()

datetime.datetime(2020, 3, 29, 18, 12, 9, 339883)

In [50]:
someday = dt.date(2020, 3, 30)

In [51]:
someday.year

2020

In [52]:
someday.month

3

In [53]:
someday.day

30

In [54]:
str(someday)

'2020-03-30'

In [1]:
sometime = dt.datetime(2020, 3, 30, 17, 13, 57)

NameError: name 'dt' is not defined

In [60]:
sometime.year

2020

In [61]:
sometime.month

3

In [62]:
sometime.day

30

In [63]:
sometime.hour

17

In [64]:
sometime.minute

13

In [65]:
sometime.second

57

## The `pandas Timestamp` Object

In [12]:
pd.Timestamp(2020, 3, 30, 11,12,50)

Timestamp('2020-03-30 11:12:50')

In [13]:
pd.Timestamp(year=2020,day=30, hour=12, month=3)

Timestamp('2020-03-30 12:00:00')

In [83]:
pd.Timestamp("2020, 3, 30, 11")

Timestamp('2020-03-30 11:00:00')

In [86]:
pd.Timestamp("2015-03-31-11")

Timestamp('2015-03-31 11:00:00')

In [87]:
pd.Timestamp("2015/03/31")

Timestamp('2015-03-31 00:00:00')

In [93]:
pd.Timestamp("1/13/2015")

Timestamp('2015-01-13 00:00:00')

In [16]:
pd.Timestamp("2013, 11, 04")

Timestamp('2013-11-04 00:00:00')

In [18]:
pd.Timestamp("19/12/2015")

Timestamp('2015-12-19 00:00:00')

In [19]:
pd.Timestamp("12/19/2015")

Timestamp('2015-12-19 00:00:00')

In [100]:
pd.Timestamp("2021-03-08 08:35:15")

Timestamp('2021-03-08 08:35:15')

In [101]:
pd.Timestamp("2021-03-08 08:35:15 PM")

Timestamp('2021-03-08 20:35:15')

In [102]:
pd.Timestamp(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [108]:
pd.Timestamp(dt.datetime(2000, 2, 3, 21, 35, 22))

Timestamp('2000-02-03 21:35:22')

## The `pandas DateTimeIndex` Object

In [3]:
dates = ["2016/01/02", "2016/04/12", "2009/09/07"]
s=pd.DatetimeIndex(dates)
s

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [4]:
dates = ["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"]
s=pd.DatetimeIndex(dates)
s

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [44]:
dates = [dt.date(2016, 1, 10), dt.date(1994, 6, 13), dt.date(2003, 12, 29)]
dtIndex = pd.DatetimeIndex(dates)
dtIndex

DatetimeIndex(['2016-01-10', '1994-06-13', '2003-12-29'], dtype='datetime64[ns]', freq=None)

In [59]:
values = [['A',100],['B', 200],['C', 300]]
df = pd.DataFrame(index = dtIndex, data = values, columns=['Name','Value'])
df

           Name  Value
2016-01-10    A    100
1994-06-13    B    200
2003-12-29    C    300

In [60]:
df['1994']

           Name  Value
1994-06-13    B    200

## The `pd.to_datetime()` Method

In [115]:
pd.to_datetime("2001-04-19")

Timestamp('2001-04-19 00:00:00')

In [63]:
pd.to_datetime("2001#04#19", format='%Y#%m#%d')

Timestamp('2001-04-19 00:00:00')

In [32]:
pd.to_datetime(dt.date(2015, 1, 1))

Timestamp('2015-01-01 00:00:00')

In [33]:
pd.to_datetime(dt.datetime(2015, 1, 1, 14, 35, 20))

Timestamp('2015-01-01 14:35:20')

In [116]:
pd.to_datetime('July 4th, 1996')

Timestamp('1996-07-04 00:00:00')

In [117]:
pd.to_datetime(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])

DatetimeIndex(['2015-01-03', '2014-02-08', '2016-01-01', '1996-07-04'], dtype='datetime64[ns]', freq=None)

In [128]:
times = pd.Series(["2015-01-03", "2014/02/08", "2016", "July 4th, 1996"])
times

0        2015-01-03
1        2014/02/08
2              2016
3    July 4th, 1996
dtype: object

In [129]:
pd.to_datetime(times)

0   2015-01-03
1   2014-02-08
2   2016-01-01
3   1996-07-04
dtype: datetime64[ns]

In [24]:
dates = pd.Series(["July 4th, 1996", "10/04/1991", "Hello", "2015-02-31"])
dates

0    July 4th, 1996
1        10/04/1991
2             Hello
3        2015-02-31
dtype: object

In [25]:
pd.to_datetime(dates, errors = "coerce")

0   1996-07-04
1   1991-10-04
2          NaT
3          NaT
dtype: datetime64[ns]

In [136]:
pd.to_datetime([1349720105, 1349806505, 1349892905, 1349979305, 1350065705], unit = "s")

DatetimeIndex(['2012-10-08 18:15:05', '2012-10-09 18:15:05',
               '2012-10-10 18:15:05', '2012-10-11 18:15:05',
               '2012-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

### pd.Period() method

In [10]:
y = pd.Period('2020')

In [11]:
y.start_time

Timestamp('2020-01-01 00:00:00')

In [12]:
y.end_time

Timestamp('2020-12-31 23:59:59.999999999')

In [14]:
y.is_leap_year

True

In [19]:
y+1

Period('2021', 'A-DEC')

In [15]:
m=pd.Period("2016-01", freq = "M")

In [16]:
m.start_time

Timestamp('2016-01-01 00:00:00')

In [17]:
m.end_time

Timestamp('2016-01-31 23:59:59.999999999')

In [18]:
m+1

Period('2016-02', 'M')

In [23]:
d=pd.Period("2020-02-28", freq = "D")

In [24]:
d.start_time

Timestamp('2020-02-28 00:00:00')

In [25]:
d.end_time

Timestamp('2020-02-28 23:59:59.999999999')

In [26]:
d+1

Period('2020-02-29', 'D')

In [28]:
d=pd.Period("2020-01-01", freq = "10D")
d.start_time

Timestamp('2020-01-01 00:00:00')

In [29]:
d.end_time

Timestamp('2020-01-10 23:59:59.999999999')

In [32]:
w=pd.Period("2020-03-30", freq = "W")
w.start_time

Timestamp('2020-03-30 00:00:00')

In [33]:
w.end_time

Timestamp('2020-04-05 23:59:59.999999999')

In [41]:
w=pd.Period("2020-03-30", freq = "W-WED")
w.start_time

Timestamp('2020-03-26 00:00:00')

In [42]:
w.end_time

Timestamp('2020-04-01 23:59:59.999999999')

### PeriodIndex

In [144]:
dates = ["2016-01-01", "2016-02-01", "2016-02-01"]
pd.PeriodIndex(dates, freq = "W-MON")

PeriodIndex(['2015-12-29/2016-01-04', '2016-01-26/2016-02-01',
             '2016-01-26/2016-02-01'],
            dtype='period[W-MON]', freq='W-MON')

In [64]:
weeks = pd.PeriodIndex(dates, freq = "W-MON")
df=pd.Series([999, 500, 325], index = weeks, name = "Weekly Revenue")
df

2015-12-29/2016-01-04    999
2016-01-26/2016-02-01    500
2016-03-01/2016-03-07    325
Freq: W-MON, Name: Weekly Revenue, dtype: int64

In [66]:
df['2016']

2015-12-29/2016-01-04    999
2016-01-26/2016-02-01    500
2016-03-01/2016-03-07    325
Freq: W-MON, Name: Weekly Revenue, dtype: int64

## Create Range of Dates with the `pd.date_range()` Method

In [48]:
times = pd.date_range(start = "2016-01-01", end = "2016-01-10", freq = "D")
times

DatetimeIndex(['2016-01-01', '2016-01-02', '2016-01-03', '2016-01-04',
               '2016-01-05', '2016-01-06', '2016-01-07', '2016-01-08',
               '2016-01-09', '2016-01-10'],
              dtype='datetime64[ns]', freq='D')

In [6]:
type(times)

pandas.tseries.index.DatetimeIndex

In [9]:
type(times[0])

pandas.tslib.Timestamp

In [22]:
pd.date_range(start = "2016-01-01", end = "2050-01-01", freq = "A")

DatetimeIndex(['2016-12-31', '2017-12-31', '2018-12-31', '2019-12-31',
               '2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31',
               '2024-12-31', '2025-12-31', '2026-12-31', '2027-12-31',
               '2028-12-31', '2029-12-31', '2030-12-31', '2031-12-31',
               '2032-12-31', '2033-12-31', '2034-12-31', '2035-12-31',
               '2036-12-31', '2037-12-31', '2038-12-31', '2039-12-31',
               '2040-12-31', '2041-12-31', '2042-12-31', '2043-12-31',
               '2044-12-31', '2045-12-31', '2046-12-31', '2047-12-31',
               '2048-12-31', '2049-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [27]:
pd.date_range(start = "2012-09-09", periods = 50, freq = "6H")

DatetimeIndex(['2012-09-09 00:00:00', '2012-09-09 06:00:00',
               '2012-09-09 12:00:00', '2012-09-09 18:00:00',
               '2012-09-10 00:00:00', '2012-09-10 06:00:00',
               '2012-09-10 12:00:00', '2012-09-10 18:00:00',
               '2012-09-11 00:00:00', '2012-09-11 06:00:00',
               '2012-09-11 12:00:00', '2012-09-11 18:00:00',
               '2012-09-12 00:00:00', '2012-09-12 06:00:00',
               '2012-09-12 12:00:00', '2012-09-12 18:00:00',
               '2012-09-13 00:00:00', '2012-09-13 06:00:00',
               '2012-09-13 12:00:00', '2012-09-13 18:00:00',
               '2012-09-14 00:00:00', '2012-09-14 06:00:00',
               '2012-09-14 12:00:00', '2012-09-14 18:00:00',
               '2012-09-15 00:00:00', '2012-09-15 06:00:00',
               '2012-09-15 12:00:00', '2012-09-15 18:00:00',
               '2012-09-16 00:00:00', '2012-09-16 06:00:00',
               '2012-09-16 12:00:00', '2012-09-16 18:00:00',
               '2012-09-17 00:00:00', '2012-09-17 06:00:00',
               '2012-09-17 12:00:00', '2012-09-17 18:00:00',
               '2012-09-18 00:00:00', '2012-09-18 06:00:00',
               '2012-09-18 12:00:00', '2012-09-18 18:00:00',
               '2012-09-19 00:00:00', '2012-09-19 06:00:00',
               '2012-09-19 12:00:00', '2012-09-19 18:00:00',
               '2012-09-20 00:00:00', '2012-09-20 06:00:00',
               '2012-09-20 12:00:00', '2012-09-20 18:00:00',
               '2012-09-21 00:00:00', '2012-09-21 06:00:00'],
              dtype='datetime64[ns]', freq='6H')

In [28]:
pd.date_range(end = "1999-12-31", periods = 100, freq = "7H")

DatetimeIndex(['1999-12-02 03:00:00', '1999-12-02 10:00:00',
               '1999-12-02 17:00:00', '1999-12-03 00:00:00',
               '1999-12-03 07:00:00', '1999-12-03 14:00:00',
               '1999-12-03 21:00:00', '1999-12-04 04:00:00',
               '1999-12-04 11:00:00', '1999-12-04 18:00:00',
               '1999-12-05 01:00:00', '1999-12-05 08:00:00',
               '1999-12-05 15:00:00', '1999-12-05 22:00:00',
               '1999-12-06 05:00:00', '1999-12-06 12:00:00',
               '1999-12-06 19:00:00', '1999-12-07 02:00:00',
               '1999-12-07 09:00:00', '1999-12-07 16:00:00',
               '1999-12-07 23:00:00', '1999-12-08 06:00:00',
               '1999-12-08 13:00:00', '1999-12-08 20:00:00',
               '1999-12-09 03:00:00', '1999-12-09 10:00:00',
               '1999-12-09 17:00:00', '1999-12-10 00:00:00',
               '1999-12-10 07:00:00', '1999-12-10 14:00:00',
               '1999-12-10 21:00:00', '1999-12-11 04:00:00',
               '1999-12-11 11:00:00', '1999-12-11 18:00:00',
               '1999-12-12 01:00:00', '1999-12-12 08:00:00',
               '1999-12-12 15:00:00', '1999-12-12 22:00:00',
               '1999-12-13 05:00:00', '1999-12-13 12:00:00',
               '1999-12-13 19:00:00', '1999-12-14 02:00:00',
               '1999-12-14 09:00:00', '1999-12-14 16:00:00',
               '1999-12-14 23:00:00', '1999-12-15 06:00:00',
               '1999-12-15 13:00:00', '1999-12-15 20:00:00',
               '1999-12-16 03:00:00', '1999-12-16 10:00:00',
               '1999-12-16 17:00:00', '1999-12-17 00:00:00',
               '1999-12-17 07:00:00', '1999-12-17 14:00:00',
               '1999-12-17 21:00:00', '1999-12-18 04:00:00',
               '1999-12-18 11:00:00', '1999-12-18 18:00:00',
               '1999-12-19 01:00:00', '1999-12-19 08:00:00',
               '1999-12-19 15:00:00', '1999-12-19 22:00:00',
               '1999-12-20 05:00:00', '1999-12-20 12:00:00',
               '1999-12-20 19:00:00', '1999-12-21 02:00:00',
               '1999-12-21 09:00:00', '1999-12-21 16:00:00',
               '1999-12-21 23:00:00', '1999-12-22 06:00:00',
               '1999-12-22 13:00:00', '1999-12-22 20:00:00',
               '1999-12-23 03:00:00', '1999-12-23 10:00:00',
               '1999-12-23 17:00:00', '1999-12-24 00:00:00',
               '1999-12-24 07:00:00', '1999-12-24 14:00:00',
               '1999-12-24 21:00:00', '1999-12-25 04:00:00',
               '1999-12-25 11:00:00', '1999-12-25 18:00:00',
               '1999-12-26 01:00:00', '1999-12-26 08:00:00',
               '1999-12-26 15:00:00', '1999-12-26 22:00:00',
               '1999-12-27 05:00:00', '1999-12-27 12:00:00',
               '1999-12-27 19:00:00', '1999-12-28 02:00:00',
               '1999-12-28 09:00:00', '1999-12-28 16:00:00',
               '1999-12-28 23:00:00', '1999-12-29 06:00:00',
               '1999-12-29 13:00:00', '1999-12-29 20:00:00',
               '1999-12-30 03:00:00', '1999-12-30 10:00:00',
               '1999-12-30 17:00:00', '1999-12-31 00:00:00'],
              dtype='datetime64[ns]', freq='7H')

## Selecting from a `DataFrame` with a `DateTimeIndex`

In [50]:
dtindex = pd.date_range(start = "2010-01-01", end = "2010-01-06", freq = "D")
data =[[30.62,31.10,30.59,30.59,38414185],[30.85,31.10,30.64,30.96,49758862],[30.88,31.08,30.52,30.77,58182332],[1,2,3,4,5],[1,2,3,4,5],[1,2,3,4,5]]
stocks = pd.DataFrame(data, index=dtindex, columns=['Open', 'High', 'Low', 'Close', 'Volume'])
stocks

             Open   High    Low  Close    Volume
2010-01-01  30.62  31.10  30.59  30.59  38414185
2010-01-02  30.85  31.10  30.64  30.96  49758862
2010-01-03  30.88  31.08  30.52  30.77  58182332
2010-01-04   1.00   2.00   3.00   4.00         5
2010-01-05   1.00   2.00   3.00   4.00         5
2010-01-06   1.00   2.00   3.00   4.00         5

In [86]:
stocks.loc["2010-01-02":"2010-01-03"]

             Open   High    Low  Close    Volume
2010-01-02  30.85  31.10  30.64  30.96  49758862
2010-01-03  30.88  31.08  30.52  30.77  58182332

In [87]:
Holidays = pd.date_range(start = "2010-01-01", end = "2010-02-01", freq = '2D')

In [88]:
mask = stocks.index.isin(Holidays)

In [89]:
stocks[mask]

             Open   High    Low  Close    Volume
2010-01-01  30.62  31.10  30.59  30.59  38414185
2010-01-03  30.88  31.08  30.52  30.77  58182332
2010-01-05   1.00   2.00   3.00   4.00         5

## `Timestamp` Object Attributes

In [51]:
stocks

             Open   High    Low  Close    Volume
2010-01-01  30.62  31.10  30.59  30.59  38414185
2010-01-02  30.85  31.10  30.64  30.96  49758862
2010-01-03  30.88  31.08  30.52  30.77  58182332
2010-01-04   1.00   2.00   3.00   4.00         5
2010-01-05   1.00   2.00   3.00   4.00         5
2010-01-06   1.00   2.00   3.00   4.00         5

In [52]:
someday = stocks.index[1]
someday

Timestamp('2010-01-02 00:00:00', freq='D')

In [53]:
someday.day
someday.month
someday.year
someday.is_month_end

False

In [54]:
someday.is_month_start

False

In [55]:
someday.day_name()

'Saturday'

In [91]:
stocks.insert(0, "is start of month", stocks.index.is_month_start)
stocks

            is start of month   Open   High    Low  Close    Volume
2010-01-01               True  30.62  31.10  30.59  30.59  38414185
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5
2010-01-05              False   1.00   2.00   3.00   4.00         5
2010-01-06              False   1.00   2.00   3.00   4.00         5

In [80]:
stocks[stocks["is start of month"]]

            is start of month   Open  High    Low  Close    Volume
2010-01-01               True  30.62  31.1  30.59  30.59  38414185

## The `.truncate()` Method

In [92]:
stocks

            is start of month   Open   High    Low  Close    Volume
2010-01-01               True  30.62  31.10  30.59  30.59  38414185
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5
2010-01-05              False   1.00   2.00   3.00   4.00         5
2010-01-06              False   1.00   2.00   3.00   4.00         5

In [93]:
stocks.truncate(before = "2010-01-02")

            is start of month   Open   High    Low  Close    Volume
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5
2010-01-05              False   1.00   2.00   3.00   4.00         5
2010-01-06              False   1.00   2.00   3.00   4.00         5

In [96]:
stocks=stocks.truncate(after = "2010-01-05")

In [97]:
stocks

            is start of month   Open   High    Low  Close    Volume
2010-01-01               True  30.62  31.10  30.59  30.59  38414185
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5
2010-01-05              False   1.00   2.00   3.00   4.00         5

In [98]:
stocks.truncate(before = "2010-01-02", after = "2010-01-04")

            is start of month   Open   High    Low  Close    Volume
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5

In [99]:
stocks

            is start of month   Open   High    Low  Close    Volume
2010-01-01               True  30.62  31.10  30.59  30.59  38414185
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5
2010-01-05              False   1.00   2.00   3.00   4.00         5

## `pd.DateOffset` Objects

In [100]:
stocks

            is start of month   Open   High    Low  Close    Volume
2010-01-01               True  30.62  31.10  30.59  30.59  38414185
2010-01-02              False  30.85  31.10  30.64  30.96  49758862
2010-01-03              False  30.88  31.08  30.52  30.77  58182332
2010-01-04              False   1.00   2.00   3.00   4.00         5
2010-01-05              False   1.00   2.00   3.00   4.00         5

In [104]:
stocks.index = stocks.index + pd.DateOffset(days=10)

In [105]:
stocks

            is start of month   Open   High    Low  Close    Volume
2010-01-11               True  30.62  31.10  30.59  30.59  38414185
2010-01-12              False  30.85  31.10  30.64  30.96  49758862
2010-01-13              False  30.88  31.08  30.52  30.77  58182332
2010-01-14              False   1.00   2.00   3.00   4.00         5
2010-01-15              False   1.00   2.00   3.00   4.00         5

## The `Timedelta` Object

In [117]:
timeA = pd.Timestamp("2016-03-31 04:35:16 PM")
timeB = pd.Timestamp("2016-03-20 02:16:49 AM")

In [118]:
timeB - timeA

Timedelta('-12 days +09:41:33')

In [119]:
type(timeA - timeB)

pandas._libs.tslibs.timedeltas.Timedelta

In [120]:
type(timeA)

pandas._libs.tslibs.timestamps.Timestamp

In [121]:
pd.Timedelta(weeks = 8, days = 3, hours = 12, minutes = 45)

Timedelta('59 days 12:45:00')

In [122]:
pd.Timedelta("14 days 6 hours 12 minutes 49 seconds")

Timedelta('14 days 06:12:49')

## `Timedeltas` in a DataFrame

In [123]:
shipping = pd.read_csv(r"C:\Users\maddir\Desktop\Python_Training\Pandas\ecommerce.csv", index_col = "ID", parse_dates = ["order_date", "delivery_date"])
shipping.head(3)

   order_date delivery_date
ID
1  1998-05-24    1999-02-05
2  1992-04-22    1998-03-06
4  1991-02-10    1992-08-26

In [124]:
shipping["Delivery Time"] = shipping["delivery_date"] - shipping["order_date"]

In [125]:
shipping.head(3)

   order_date delivery_date Delivery Time
ID
1  1998-05-24    1999-02-05      257 days
2  1992-04-22    1998-03-06     2144 days
4  1991-02-10    1992-08-26      563 days

In [126]:
shipping["Twice As Long"] = shipping["delivery_date"] + shipping["Delivery Time"]

In [127]:
shipping.head(3)

   order_date delivery_date Delivery Time Twice As Long
ID
1  1998-05-24    1999-02-05      257 days    1999-10-20
2  1992-04-22    1998-03-06     2144 days    2004-01-18
4  1991-02-10    1992-08-26      563 days    1994-03-12

In [128]:
shipping.dtypes

order_date        datetime64[ns]
delivery_date     datetime64[ns]
Delivery Time    timedelta64[ns]
Twice As Long     datetime64[ns]
dtype: object

In [129]:
mask = shipping["Delivery Time"] == "3423 days"
shipping[mask]

    order_date delivery_date Delivery Time Twice As Long
ID
130 1990-04-02    1999-08-16     3423 days    2008-12-29

In [132]:
shipping["Delivery Time"].min()

Timedelta('8 days 00:00:00')

In [133]:
shipping["Delivery Time"].max()

Timedelta('3583 days 00:00:00')